In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'A': [1,2,3,4],
                    'B': ['b','b','b','b'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In groups of 2, I'd like each group to tackle one question (if you are done, with your question, try yourself on a different one:
    - delete column 'B' of df1
    - add a columns '007' with 0's on df1
    - merge df1, df2 horizontally on a same index base
    - rename df2's columns to lowercase
    - groupby df1 on 'B' with the mean of 'A' (and return a dataframe)
    - add a row with 1's on df2

In [3]:
df1.drop('B', axis='columns')

   A   C   D
0  1  C0  D0
1  2  C1  D1
2  3  C2  D2
3  4  C3  D3

In [4]:
df1['007'] = 0

In [5]:
df1

   A  B   C   D  007
0  1  b  C0  D0    0
1  2  b  C1  D1    0
2  3  b  C2  D2    0
3  4  b  C3  D3    0

In [7]:
pd.concat([df1, df2.reset_index(drop=True)], axis='columns')

   A  B   C   D  007   A   B   C   D
0  1  b  C0  D0    0  A4  B4  C4  D4
1  2  b  C1  D1    0  A5  B5  C5  D5
2  3  b  C2  D2    0  A6  B6  C6  D6
3  4  b  C3  D3    0  A7  B7  C7  D7

In [13]:
df2.columns = [col.lower() for col in df2.columns]

In [14]:
df2

    a   b   c   d
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [16]:
df1.groupby('B')[['A']].mean()

     A
B
b  2.5

In [17]:
df2

    a   b   c   d
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [24]:
pd.concat([df2, pd.DataFrame(np.zeros(shape=(1,df2.shape[1])), columns=df2.columns)], axis=0)

    a   b   c   d
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
0   0   0   0   0